[
    {
        "idx":0,
        "name":"김두식",
        "desc":"비행 능력을 지닌 전직 안기부 최정예 블랙 요원으로 이미현의 남편이자 김봉석의 아버지다. 최정예라는 이름에 걸맞게 권총 사격, 대인격투술이 매우 뛰어나며, 이를 자신의 비행 능력과 조합하여 매우 현란하게 싸운다.[1] 신체 능력도 초인 수준은 아니지만 일반인 레벨에서는 상당히 뛰어나다. 나주의 저격으로 어깨에 총을 맞고, 진천의 괴력으로 한번 땅에 강하게 메쳐지고, 봉평의 전기 공격을 당했음에도 크게 힘든 기색이 없다. 실력은 최고지만 간간히 제멋대로 행동해 민용준에게 사상을 의심받는다. 장주원을 처음 대면할 때도 서로의 본명은 언급하지 말고 암호명과 직급으로만 부르라는 민용준의 말이 무색하게 바로 선배라 부르라고 하고 본명을 밝히는 등 민용준에게 반감을 드러내는 경우가 있다."
    },
    {
        "idx":1,
        "name":"이강훈",
        "desc":"김봉석과 장희수네 반의 반장. 신체 능력자로 확인되었다. 처음부터 장희수에게 관심을 가지고 있었으며 김봉석과 이어지는걸 알게 모르게 시기한다. 그리고 희수가 서전트 점프를 한 장소에서 두 배는 넘게 점프하면서 능력을 몸소 인증. 능력은 초인적인 힘과 스피드. 손바닥으로 내려친 벽이 금이 갔고 높이도 엄청난 각력을 이용해 뛴것으로 보인다.     "
    },
    {
        "idx":2,
        "name":"이미현",
        "desc":"김봉석의 어머니이자 김두식의 아내로 현재 돈가스 식당을 운영한다. 먼 곳을 망원경처럼 내다보거나[5] 윗층의 소리를 도청기급으로 듣고, 돈가스를 먹으며 소스의 재료를 전부 알아내거나 커피의 황금비를 완벽하게 알아채는 등 초인적인 오감을 지녔다."
    },
    {
        "idx":3,
        "name":"장주원",
        "desc":"다쳐도 금방 회복하는 무한 재생 능력을 지닌 인물. 데드풀, 울버린과 비슷하게 고통을 느끼기는 하지만 잘 참는다. 다만 총알 같이 체내에 남아서 상처가 아무는 것을 방해하는 이물질이 오래 남아있으면 완전히 회복되지 않고 흉터가 남는다. 총에 맞은 눈알을 빼버린 후 애꾸 상태로 지내는 것으로 보아 결손된 부분까지 재생하지는 못하는 것으로 보인다."
    },
    {
        "idx":4,
        "name":"이재만",
        "desc":"이강훈의 아버지로 빠른 속도와 강력한 힘을 지닌 인물이나 말투가 어눌한 지적 장애인이다. 과거 청계천에서 지게꾼으로 일했다. 아내와 함께 작은 슈퍼마켓을[10] 운영하며 매일 저녁 같은 자리에 앉아 아들이 오기만을 기다린다.[11] 국정원 특별 관리 대상이라 보호관찰 위치를 벗어나면 국정원에 알려진다."
    },
    {
        "idx":5,
        "name":"최일환",
        "desc":"정원고 사건 이후 국정원을 그만두고 정원고에서 전근 신청을 한다. 그러나 주위에서 폭발 사고로 위장된 암살 기도가 연이어 생기고 그럴 때마다 자신도 모르게 위기에서 벗어나게 되자 예전에 의심했지만 물증이 없어서 넘어갔던 초능력자 후보 김영탁을 찾아가게 된다.[5] 막판에는 차를 몰고 가다가 국정원이 본인과 김영탁을 모두 처치할 기회를 노리고 판 함정에 빠질 뻔하나, 영탁이 막아주며 살아난다. 이후 서로 추격전을 벌이는 제자 강훈과 영탁을 말리려고 하지만, 국정원 요원들에게 저지당한다."
    },
    {
        "idx":6,
        "name":"장희수",
        "desc":"문자 그대로 17대 1로 일진들을 때려눕혀 전학오게 되었는데, 전혀 상처가 없었다고 한다.[1] 게다가 극중 자신은 절대 다치지 않는다.[2]라는 말을 반복적으로 하는걸 보아 초재생능력이나 금강불괴같은 특이한 신체를 가지고 있다는게 거의 확실시 되고있다. 실제 나온 능력은 무통증+예상대로 초재생능력.클레어 베넷 반창고나 붕대를 써본 적이 없고 보통이면 기절했을 상황에서도 제정신을 차린적도 있다.[3] 어릴때부터 다친 적은 많은데 흉터 하나 없는 몸이다. 총이나 칼, 교통사고, 폭탄 등의 물리적 타격으로는 죽기는 커녕 흉터도 남을 수 없을 만큼 뼈나 내장, 근육, 인대 등 주요조직뿐만 아니라 피부조직까지 다 알아서 몇 초 안에 재생되는 어마어마한 회복력을 가진 몸인 듯."
    },
    {
        "idx":7,
        "name":"김봉석",
        "desc":"어렸을 때 아버지가 잠적한 이후[2] 더이상 능력을 쓰지 말라는 어머니의 간곡한 부탁으로 무의식 중에 뜨는 걸 막기 위해 모래주머니를 매달고 다니고 살도 쪄서 더이상 공중에 뜨지 않게되어 평범한 생활을 영위하고 있었다. 하지만 고3 여름방학 때 전학 온 희수로 인해 모든 것이 바뀌기 시작한다. 희수를 처음 보자마자 호감을 느끼고 희수가 머리를 만져 옷이 올라가 배가 보이자 그걸 보고 첨벙 하며 떠오르게 된다. 희수에게 잘 보이기 위해 날아다니기 시작하다가 어머니와 싸우게 되지만 그로 인해 어머니와 아버지의 국정원에서 일한 초능력자라는 과거사에 대해 자세히 듣게 되었고 이후에 화해를 한 후, 더이상 억압을 받지 않게 된다. 또한 이때 아빠로부터 들은 날 수 있는 법까지 전수받으면서[3] 결국 완전히 자유자재로 날 수 있게 된다."
    },
    {
        "idx":8,
        "name":"전계도",
        "desc":"원작에는 등장하지 않는 오리지널 캐릭터로 아버지의 능력을 물려받아 전기를 다루는 능력이 있다. 작중 김봉석이 매일 등하교하는 시내버스 기사[1]로 일한다. 능력 역시 드라마 오리지널 설정으로 손에서 전기를 일으켜 주위의 전기를 조작하거나 손에 전기를 둘러 공격하는 식으로 사용한다. 다만, 평소에는 정전기 수준이라 건전지, 배터리 등의 전기가 있는 매개체가 있어야 능력 발현이 배가되는 것으로 보인다. 또한, 단순히 전기만 다루는 것을 넘어 기억까지 전기적 형태로 저장이 가능하다는 것이 밝혀졌는데, 매개체로 삼은 물건이 배터리 같은 전기를 저장할 수 있는 형태의 물질이라면 기억을 전기 형태로 저장하는 방법도 있는 것으로 보인다."
    }
]