// Pilot PJ : 신상품 정보 데이터

export const sinsangData = {   
  "men":{
    "m1": "[남성]카모전판프린트 PQ 티셔츠^DMTS7K731-MG^99000",
    "m2": "[남성]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-BK ^89000",
    "m3": "[남성]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-WH ^89000",
    "m4": "[남성]부분 스트라이프 PQ 티셔츠^DMTS77731-NY ^99000",
    "m5": "[남성]웰딩포인트 트레이닝 하프팬츠^DMTB61731-MD ^89000",
    "m6": "[남성]블럭형 풀집업 래쉬가드^DMSW21731-GR ^99000",
    "m7": "[남성]블럭형 풀집업 래쉬가드^DMSW21731-KA ^99000",
    "m8": "[남성]베이직 솔리드 래쉬가드^DMSW15731-BK ^49000",
    "m9": "[남성]남성 루즈핏 슬리브리스^DMSL6C731-MG ^59000"},
  "women":{
    "m1": "[여성]카모전판프린트 PQ 티셔츠^DMTS7K731-MG^99000",
    "m2": "[여성]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-BK ^89000",
    "m3": "[여성]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-WH ^89000",
    "m4": "[여성]부분 스트라이프 PQ 티셔츠^DMTS77731-NY ^99000",
    "m5": "[여성]웰딩포인트 트레이닝 하프팬츠^DMTB61731-MD ^89000",
    "m6": "[여성]블럭형 풀집업 래쉬가드^DMSW21731-GR ^99000",
    "m7": "[여성]블럭형 풀집업 래쉬가드^DMSW21731-KA ^99000",
    "m8": "[여성]베이직 솔리드 래쉬가드^DMSW15731-BK ^49000",
    "m9": "[여성]여성 루즈핏 슬리브리스^DMSL6C731-MG ^59000"},
  "style":{
    "m1": "[스타일]카모전판프린트 PQ 티셔츠^DMTS7K731-MG^99000",
    "m2": "[스타일]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-BK ^89000",
    "m3": "[스타일]빅로고 컬러 블럭 PQ 티셔츠^DMTS7G731-WH ^89000",
    "m4": "[스타일]부분 스트라이프 PQ 티셔츠^DMTS77731-NY ^99000",
    "m5": "[스타일]웰딩포인트 트레이닝 하프팬츠^DMTB61731-MD ^89000",
    "m6": "[스타일]블럭형 풀집업 래쉬가드^DMSW21731-GR ^99000",
    "m7": "[스타일]블럭형 풀집업 래쉬가드^DMSW21731-KA ^99000",
    "m8": "[스타일]베이직 솔리드 래쉬가드^DMSW15731-BK ^49000",
    "m9": "[스타일]루즈핏 슬리브리스^DMSL6C731-MG ^59000"},
   
}